
[ssphp_add_display_colours]
definition = """
| foreach ssphp_norm_* [| eval <<FIELD>>_display=trim('<<FIELD>>')]

| rex mode=sed field=ssphp_norm_time_display "s/^Creation Time = /¬¬~!span class=\"blue\"~!Creation Time"~!\/span~!"¬¬/g"
| rex mode=sed field=ssphp_norm_time_display "s/^Alert Event Time = /¬¬~!span class=\"blue\"~!Alert Event Time"~!\/span~!"¬¬/g"
| rex mode=sed field=ssphp_norm_time_display "s/^Last Changed Time = /¬¬~!span class=\"blue\"~!Last Changed Time~!\/span~!¬¬/g"
| rex mode=sed field=ssphp_norm_time_display "s/^Start Time = /¬¬~!span class=\"blue\"~!Start Time"~!\/span~!"¬¬/g"
| rex mode=sed field=ssphp_norm_time_display "s/^Last Fixed = /¬¬~!span class=\"blue\"~!Last Fixed"~!\/span~!"¬¬/g"
| rex mode=sed field=ssphp_norm_time_display "s/^Last Found = /¬¬~!span class=\"blue\"~!Last Found"~!\/span~!"¬¬/g"
| rex mode=sed field=ssphp_norm_time_display "s/^Last Scan = /¬¬~!span class=\"blue\"~!Last Scan"~!\/span~!"¬¬/g"
| rex mode=sed field=ssphp_norm_time_display "s/^Last Test = /¬¬~!span class=\"blue\"~!Last Test"~!\/span~!"¬¬/g"
| rex mode=sed field=ssphp_norm_time_display "s/^Last Update = /¬¬~!span class=\"blue\"~!Last Update"~!\/span~!"¬¬/g"
| rex mode=sed field=ssphp_norm_time_display "s/^Last VM Scanned = /¬¬~!span class=\"blue\"~!Last VM Scanned"~!\/span~!"¬¬/g"
| rex mode=sed field=ssphp_norm_time_display "s/^First Found = /¬¬~!span class=\"blue\"~!First Found"~!\/span~!"¬¬/g"

| rex mode=sed field=ssphp_norm_resource_parent_display "s/^Tenant = /¬¬~!span class=\"blue\"~!Tenant~!\/span~!¬¬/g"
| rex mode=sed field=ssphp_norm_resource_parent_display "s/^Subscription = /¬¬~!span class=\"blue\"~!Subscription~!\/span~!¬¬/g"
| rex mode=sed field=ssphp_norm_resource_parent_display "s/^Resource Group = /¬¬~!span class=\"blue\"~!Resource Group~!\/span~!¬¬/g"
| rex mode=sed field=ssphp_norm_resource_parent_display "s/^Organisation = /¬¬~!span class=\"blue\"~!Organisation~!\/span~!¬¬/g"

| rex mode=sed field=ssphp_norm_ownership_display "s/^DfE Group=/¬¬~!span class=\"blue\"~!DfE Group~!\/span~!¬¬/g"
| rex mode=sed field=ssphp_norm_ownership_display "s/^DfE Group = /¬¬~!span class=\"blue\"~!DfE Group~!\/span~!¬¬/g"
| rex mode=sed field=ssphp_norm_ownership_display "s/^DfE Service=/¬¬~!span class=\"blue\"~!DfE Service~!\/span~!¬¬/g"
| rex mode=sed field=ssphp_norm_ownership_display "s/^DfE Service = /¬¬~!span class=\"blue\"~!DfE Service~!\/span~!¬¬/g"

| rex mode=sed field=ssphp_norm_contact_display "s/^Service Team=/¬¬~!span class=\"blue\"~!DfE Service Team~!\/span~!¬¬/g"
| rex mode=sed field=ssphp_norm_contact_display "s/^Service Team = /¬¬~!span class=\"blue\"~!DfE Service Team~!\/span~!¬¬/g"
| rex mode=sed field=ssphp_norm_contact_display "s/^Tech Contact Email = /¬¬~!span class=\"blue\"~!Tech Contact Email~!\/span~!¬¬/g"

| rex mode=sed field=ssphp_norm_resource_display "s/^Repo = /¬¬~!span class=\"blue\"~!Repo~!\/span~!¬¬/g"
| rex mode=sed field=ssphp_norm_resource_display "s/\(private\)/¬¬~!span class=\"lightblue\"~!(private)~!\/span~!¬¬/g"
| rex mode=sed field=ssphp_norm_resource_display "s/\(public\)/¬¬~!span class=\"lightblue\"~!(public)~!\/span~!¬¬/g"
| rex mode=sed field=ssphp_norm_resource_display "s/Host Name = /¬¬~!span class=\"blue\"~!Host Name~!\/span~!¬¬/g"
| rex mode=sed field=ssphp_norm_resource_display "s/Host ID = /¬¬~!span class=\"blue\"~!Host ID~!\/span~!¬¬/g"
| rex mode=sed field=ssphp_norm_resource_display "s/IP = /¬¬~!span class=\"blue\"~!IP~!\/span~!¬¬/g"
| rex mode=sed field=ssphp_norm_resource_display "s/OS = /¬¬~!span class=\"blue\"~!OS~!\/span~!¬¬/g"
| rex mode=sed field=ssphp_norm_resource_display "s/NetBios = /¬¬~!span class=\"blue\"~!NetBios~!\/span~!¬¬/g"

| rex mode=sed field=ssphp_norm_title_display "s/^Title = /¬¬~!span class=\"blue\"~!Title~!\/span~!¬¬/g"
| rex mode=sed field=ssphp_norm_title_display "s/^QID = /¬¬~!span class=\"blue\"~!QID~!\/span~!¬¬/g"

| eval ssphp_norm_impact_display=if(ssphp_norm_impact_display="Impact =","unknown",ssphp_norm_impact_display)
| rex mode=sed field=ssphp_norm_impact_display "s/Impact = /¬¬~!span class=\"blue\"~!Impact~!\/span~!¬¬/g"
| rex mode=sed field=ssphp_norm_impact_display "s/Tactics = /¬¬~!span class=\"blue\"~!Tactics~!\/span~!¬¬/g"
| rex mode=sed field=ssphp_norm_impact_display "s/Techniques = /¬¬~!span class=\"blue\"~!Techniques~!\/span~!¬¬/g"
| rex mode=sed field=ssphp_norm_impact_display "s/Threats = /¬¬~!span class=\"blue\"~!Threats~!\/span~!¬¬/g"
| rex mode=sed field=ssphp_norm_impact_display "s/Threat Intel = /¬¬~!span class=\"blue\"~!Threat Intel~!\/span~!¬¬/g"
| rex mode=sed field=ssphp_norm_impact_display "s/CIS Control Domains =/¬¬~!span class=\"blue\"~!CIS Control Domains~!\/span~!¬¬/g"

| rex mode=sed field=ssphp_norm_status_display "s/^Action=/¬¬~!span class=\"blue\"~!Action~!\/span~!¬¬/g"
| rex mode=sed field=ssphp_norm_status_display "s/^State=/¬¬~!span class=\"blue\"~!State~!\/span~!¬¬/g"

| rex mode=sed field=ssphp_norm_description_display "s/^User Login = /¬¬~!span class=\"blue\"~!User Login~!\/span~!¬¬/g"
| rex mode=sed field=ssphp_norm_description_display "s/^User URL = /¬¬~!span class=\"blue\"~!User URL~!\/span~!¬¬/g"
| rex mode=sed field=ssphp_norm_description_display "s/Description = /¬¬~!span class=\"blue\"~!Description~!\/span~!¬¬/g"
| rex mode=sed field=ssphp_norm_description_display "s/^Secret Scanning Status Before Change = /¬¬~!span class=\"blue\"~!Secret Scanning Status Before Change~!\/span~!¬¬/g"
| rex mode=sed field=ssphp_norm_description_display "s/^Push Protection Status Before Change = /¬¬~!span class=\"blue\"~!Push Protection Status Before Change~!\/span~!¬¬/g"
| rex mode=sed field=ssphp_norm_description_display "s/^CVE ID = /¬¬~!span class=\"blue\"~!CVE ID~!\/span~!¬¬/g"
| rex mode=sed field=ssphp_norm_description_display "s/^Ecosystem = /¬¬~!span class=\"blue\"~!Ecosystem~!\/span~!¬¬/g"
| rex mode=sed field=ssphp_norm_description_display "s/Package = /¬¬~!span class=\"blue\"~!Package~!\/span~!¬¬/g"
| rex mode=sed field=ssphp_norm_description_display "s/Category = /¬¬~!span class=\"blue\"~!Category~!\/span~!¬¬/g"
| rex mode=sed field=ssphp_norm_description_display "s/Location Path = /¬¬~!span class=\"blue\"~!Location Path~!\/span~!¬¬/g"
| rex mode=sed field=ssphp_norm_description_display "s/Message Text = /¬¬~!span class=\"blue\"~!Message Text~!\/span~!¬¬/g"
| rex mode=sed field=ssphp_norm_description_display "s/Commit Branch = /¬¬~!span class=\"blue\"~!Commit Branch~!\/span~!¬¬/g"
| rex mode=sed field=ssphp_norm_description_display "s/Commit SHA = /¬¬~!span class=\"blue\"~!Commit SHA~!\/span~!¬¬/g"
| rex mode=sed field=ssphp_norm_description_display "s/Push Time = /¬¬~!span class=\"blue\"~!Push Time~!\/span~!¬¬/g"
| rex mode=sed field=ssphp_norm_description_display "s/Secret Type = /¬¬~!span class=\"blue\"~!Secret Type~!\/span~!¬¬/g"
| rex mode=sed field=ssphp_norm_description_display "s/Push Protection Bypassed\? = /¬¬~!span class=\"blue\"~!Push Protection Bypassed\?~!\/span~!¬¬/g"
| rex mode=sed field=ssphp_norm_description_display "s/Alert Resolved At = /¬¬~!span class=\"blue\"~!Alert Resolved At~!\/span~!¬¬/g"
| rex mode=sed field=ssphp_norm_description_display "s/Alert Resolved By = /¬¬~!span class=\"blue\"~!Alert Resolved By~!\/span~!¬¬/g"
| rex mode=sed field=ssphp_norm_description_display "s/Commit URL = /¬¬~!span class=\"blue\"~!Commit URL~!\/span~!¬¬/g"
| rex mode=sed field=ssphp_norm_description_display "s/Rule = /¬¬~!span class=\"blue\"~!Rule~!\/span~!¬¬/g"
| rex mode=sed field=ssphp_norm_description_display "s/Name Changed From = /¬¬~!span class=\"blue\"~!Name Changed From~!\/span~!¬¬/g"
| rex mode=sed field=ssphp_norm_description_display "s/Merge Queue Enforcement Level From = /¬¬~!span class=\"blue\"~!Merge Queue Enforcement Level From~!\/span~!¬¬/g"
| rex mode=sed field=ssphp_norm_description_display "s/Deployment Changes Required Enforcement Level = /¬¬~!span class=\"blue\"~!Deployment Changes Required Enforcement Level~!\/span~!¬¬/g"
| rex mode=sed field=ssphp_norm_description_display "s/Pull Request Reviews Enforcement Level = /¬¬~!span class=\"blue\"~!Pull Request Reviews Enforcement Level~!\/span~!¬¬/g"
| rex mode=sed field=ssphp_norm_description_display "s/Admin Enforced = /¬¬~!span class=\"blue\"~!Admin Enforced~!\/span~!¬¬/g"
| rex mode=sed field=ssphp_norm_description_display "s/Required Status Checks Enforcement Level = /¬¬~!span class=\"blue\"~!Required Status Checks Enforcement Level~!\/span~!¬¬/g"
| rex mode=sed field=ssphp_norm_description_display "s/Allow Force Pushes Enforcement Level = /¬¬~!span class=\"blue\"~!Allow Force Pushes Enforcement Level~!\/span~!¬¬/g"
| rex mode=sed field=ssphp_norm_description_display "s/Results = /¬¬~!span class=\"blue\"~!Results~!\/span~!¬¬/g"
| rex mode=sed field=ssphp_norm_description_display "s/Diagnosis = /¬¬~!span class=\"blue\"~!Diagnosis~!\/span~!¬¬/g"
| rex mode=sed field=ssphp_norm_description_display "s/Consequence = /¬¬~!span class=\"blue\"~!Consequence~!\/span~!¬¬/g"
| rex mode=sed field=ssphp_norm_description_display "s/^Azure = /¬¬~!span class=\"blue\"~!Azure~!\/span~!¬¬/g"
| rex mode=sed field=ssphp_norm_description_display "s/^CIS Control ID = /¬¬~!span class=\"blue\"~!CIS Control ID~!\/span~!¬¬/g"


| rex mode=sed field=ssphp_norm_severity_display "s/^Severity = /¬¬~!span class=\"blue\"~!Severity~!\/span~!¬¬/g"
| rex mode=sed field=ssphp_norm_severity_display "s/^CIS Implementation Group = /¬¬~!span class=\"blue\"~!CIS Implementation Group~!\/span~!¬¬/g"

```| eval ssphp_norm_severity_display=case(ssphp_norm_severity_display="High","¬¬~!span class=\"red\"~!High~!/span~!¬¬",
       ssphp_norm_severity_display="Medium","¬¬~!span class=\"orange\"~!Medium~!/span~!¬¬",
       ssphp_norm_severity_display="Low","¬¬~!span class=\"yellow\"~!Low~!/span~!¬¬",
       1==1,ssphp_norm_severity_display)```
| rex mode=sed field=ssphp_norm_severity_display "s/High/~!span class=\"red\"~!High"~!\/span~!"/g"
| rex mode=sed field=ssphp_norm_severity_display "s/Medium/~!span class=\"orange\"~!Medium"~!\/span~!"/g"
| rex mode=sed field=ssphp_norm_severity_display "s/Low/~!span class=\"yellow\"~!Low"~!\/span~!"/g"

| foreach *_display
    [
| eval <<FIELD>>=mvjoin('<<FIELD>>',"~~~"),
       <<FIELD>>=replace('<<FIELD>>',"^¬¬",""),
       <<FIELD>>=replace('<<FIELD>>',"¬¬","
"),
       <<FIELD>>=split('<<FIELD>>',"~~~")
    ]

| foreach ssphp_norm_* 
[| rex mode=sed field=<<FIELD>>_display "s/unknown/~!span class=\"lightgrey\"~!unknown"~!\/span~!"/g"
 | rex mode=sed field=<<FIELD>>_display "s/Unknown/~!span class=\"lightgrey\"~!unknown"~!\/span~!"/g"]

| eval ssphp_norm_resource_display_temp="~~~".mvjoin(ssphp_norm_resource_display,"¬¬¬~~~")."¬¬¬",
       ssphp_norm_resource_display_temp=replace(ssphp_norm_resource_display_temp, "~~~([^=~]*)=", "~~~~!span class=\"green\"~!\1=~!/span~!"),
       ssphp_norm_resource_display_temp=replace(ssphp_norm_resource_display_temp, "¬¬¬~~~","@@@:::@@@"),
       ssphp_norm_resource_display_temp=replace(ssphp_norm_resource_display_temp, "~~~",""),
       ssphp_norm_resource_display_temp=replace(ssphp_norm_resource_display_temp, "¬¬¬",""),
       ssphp_norm_resource_display_temp=split(ssphp_norm_resource_display_temp,"@@@:::@@@"),
	   ssphp_norm_resource_display=case(like(ssphp_norm_resource_display,"%Repo%"),'ssphp_norm_resource_display',
									    ssphp_norm_tech_source="Qualys",'ssphp_norm_resource_display',
	                                    1==1,'ssphp_norm_resource_display_temp')
| fields - ssphp_norm_resource_display_temp

| rex mode=sed field=ssphp_norm_description_display "s/<br>/
/g"
| rex mode=sed field=ssphp_norm_description_display "s/<\/br>/
/g"
| rex mode=sed field=ssphp_norm_remediation_display "s/<br>/
/g"
| rex mode=sed field=ssphp_norm_remediation_display "s/<\/br>/
/g"
"""

iseval = 0

######################################################################

[ssphp_azure_add_ip_addresses]
definition = """
```PUBLIC IP Addresses```
| eval ssphp_publicipaddresses_id=case(type="microsoft.network/networkinterfaces",lower('properties.ipConfigurations{}.properties.publicIPAddress.id'),
                                       type="microsoft.network/publicipaddresses",lower('id'),
                                       type="microsoft.network/loadbalancers",lower('properties.frontendIPConfigurations{}.properties.publicIPAddress.id'))
| eval ssphp_public_ip_address=if(type="microsoft.network/publicipaddresses",'properties.ipAddress',null())
| eventstats values(ssphp_public_ip_address) as ssphp_public_ip_address by ssphp_publicipaddresses_id
| eval ssphp_public_ip_address=case(type="microsoft.compute/virtualmachines",ssphp_public_ip_address,
                                     type="microsoft.network/loadbalancers",ssphp_public_ip_address,
                                     type="microsoft.network/publicipaddresses",ssphp_public_ip_address,
                                     type="microsoft.network/networkinterfaces",ssphp_public_ip_address,
                                     1==1,null())

```PRIVATE IP Addresses```
| eval key=case(type="microsoft.network/networkinterfaces",lower('properties.virtualMachine.id'),
                type="microsoft.compute/virtualmachines",lower('id'))
| eval ssphp_private_ip_address=if(type="microsoft.network/networkinterfaces",'properties.ipConfigurations{}.properties.privateIPAddress',null()),
       ssphp_nic_id=if(type="microsoft.network/networkinterfaces",lower('id'),null())
| eventstats values(ssphp_private_ip_address) as ssphp_private_ip_address, values(ssphp_nic_id) as ssphp_nic_id, values(ssphp_publicipaddresses_id) as ssphp_publicipaddresses_id, values(ssphp_public_ip_address) as ssphp_public_ip_address by key

| eval ssphp_private_ip_address=case(type="microsoft.compute/virtualmachines",ssphp_private_ip_address,
                                     type="microsoft.network/loadbalancers",'properties.frontendIPConfigurations{}.properties.privateIPAddress',
                                     type="microsoft.network/networkinterfaces",'properties.ipConfigurations{}.properties.privateIPAddress',
                                     1==1,null())
| eval ssphp_all_ip_addresses=mvappend('ssphp_private_ip_address','ssphp_public_ip_address')
| fields - key, ssphp_nic_id, ssphp_publicipaddresses_id

"""

iseval = 0

######################################################################

[ssphp_create_all_findings_times_search_string]
definition = """
| tstats summariesonly=false count FROM datamodel=SSPHP.findings by findings.SSPHP_RUN, findings.ssphp_norm_use_case
| rename findings.* as *
| eval ssphp_run_yymm=strftime(SSPHP_RUN,"%Y-%m-%d")
| stats max(SSPHP_RUN) as SSPHP_RUN by ssphp_norm_use_case, ssphp_run_yymm
| stats values(SSPHP_RUN) as SSPHP_RUN by ssphp_norm_use_case
| eval return_search_string="(findings.ssphp_norm_use_case=\"".ssphp_norm_use_case."\" AND (findings.SSPHP_RUN=".mvjoin(SSPHP_RUN," OR findings.SSPHP_RUN=")."))"
| stats values(return_search_string) as return_search_string
| eval return_search_string=mvjoin(return_search_string," OR "),
       return_search_string="(".return_search_string.")"
    | return $return_search_string

"""

iseval = 0

######################################################################

[ssphp_create_latest_findings_times_search_string]
definition = """
| tstats summariesonly=false max(findings.SSPHP_RUN) as SSPHP_RUN FROM datamodel=SSPHP.findings by findings.ssphp_norm_use_case
| rename findings.* as *
| eval search_text="(findings.ssphp_norm_use_case=\"".'ssphp_norm_use_case'."\" AND findings.SSPHP_RUN=".SSPHP_RUN.")"
| stats values(search_text) as search_text
| eval search_text="(".mvjoin(search_text," OR ").")"
| return $search_text

"""

iseval = 0

######################################################################

[ssphp_normalise_display_fields]
definition = """
| eval impact_old='ssphp_norm_impact'
| rex field=ssphp_norm_impact "^CIS Control Domains = (?<cis_control_domains>[^
]*)
(?<the_rest_impact>[\s\S]*)"
| eval the_rest_impact=split(the_rest_impact,"
"),
       ssphp_norm_impact=if(isnotnull(cis_control_domains),mvappend("CIS Control Domains = ",mvsort(split(cis_control_domains,", ")),the_rest_impact),split(impact_old,'lf'))

| eval ssphp_norm_severity=mvfilter(NOT match(ssphp_norm_severity,"IG[1|2|3] = 0"))
| rex mode=sed field=ssphp_norm_severity "s/^IG1 = 1/IG1/g"
| rex mode=sed field=ssphp_norm_severity "s/^IG2 = 1/IG2/g"
| rex mode=sed field=ssphp_norm_severity "s/^IG3 = 1/IG3/g"

"""

iseval = 0

######################################################################

[ssphp_normalise_service_taxonomy_fields]
definition = """
```=======================start macro=================================================```
| fillnull value="Unknown"

| foreach * [eval "<<FIELD>>_normalised"=lower('<<FIELD>>')]

| foreach *_normalised [eval "<<FIELD>>"=replace('<<FIELD>>'," \(pp\)",""),
                             "<<FIELD>>"=replace('<<FIELD>>'," \(crm\)","")
                        | rex field="<<FIELD>>" mode=sed "s/[^a-zA-Z0-9 ]//g"
                        ]

``` parent business outliers```
| eval ssphp_parent_business_normalised=case(ssphp_parent_business_normalised="funding and allocation","funding and allocations",
                                             ssphp_parent_business_normalised="systems for nondepartmental public bodie","systems for nondepartmental public bodies",
                                             ssphp_parent_business_normalised="schools  school performance","schools and school performance",
                                             1==1,ssphp_parent_business_normalised)

``` service outliers```
| eval ssphp_service_normalised=case(match(ssphp_service_normalised,"archived system(s|shared)*"),"archived systems",
                                     match(ssphp_service_normalised,"business intelligence*"),"business intelligence",
                                     match(ssphp_service_normalised,"corporate services*"),"corporate services",
                                     ssphp_service_normalised="archiving system","archiving service",
                                     ssphp_service_normalised="schools  school performance","schools and school performance",
                                     ssphp_service_normalised="dfe sign in","dfe signin",
                                     match(ssphp_service_normalised,"software distribution and patch management*"),"software distribution and patch management",
                                     1==1,ssphp_service_normalised)

| eval sspsp_business=mvsort(mvdedup(coalesce(ssphp_portfolio_normalised, ssphp_parent_business_normalised)))
| fillnull value="-"
| eval ssphp_unit=mvsort(mvdedup(mvappend(ssphp_portfolio_normalised, ssphp_parent_business_normalised, ssphp_service_normalised, ssphp_service_line_normalised, ssphp_service_offering_normalised, ssphp_product_normalised)))
| eval ssphp_unit=mvjoin(ssphp_unit,"~~")

| eval L1=case(like(ssphp_unit,"%education and skills funding agency%"),"education and skills funding agency",
               like(ssphp_unit,"%data directorate%"),"data directorate",
               like(ssphp_unit,"%early years and schools group%"),"early years and schools group",
               like(ssphp_unit,"%schools and school performance%"),"schools and school performance",
               like(ssphp_unit,"%analyse schools performance%"),"schools and school performance",
               like(ssphp_unit,"%school services%"),"school services",
               like(ssphp_unit,"%get information about schools%"),"school services",
               like(ssphp_unit,"%teacher services%"),"teacher services",
               like(ssphp_unit,"%systems for nondepartmental public bodies%"),"systems for nondepartmental public bodies",
               like(ssphp_unit,"%teacher misconduct%"),"teacher misconduct",
               like(ssphp_unit,"%digital and technology%"),"digital and technology",
               like(ssphp_unit,"%social care mobility and disadvantage group%"),"social care mobility and disadvantage group",
               like(ssphp_unit,"%social workforce%"),"social care mobility and disadvantage group",
               like(ssphp_unit,"%data collections%"),"data directorate",
               like(ssphp_unit,"%institute data service%"),"data directorate",
               like(ssphp_unit,"%data archiving platform%"),"data directorate",
               like(ssphp_unit,"%operations group%"),"operations group",
               like(ssphp_unit,"%dfe infrastructure%"),"DfE infrastructure",
               like(ssphp_unit,"%infrastructure and platforms%"),"DfE infrastructure",
               like(ssphp_unit,"%further education%"),"further education",
               like(ssphp_unit,"%childrens care%"),"childrens care",
               like(ssphp_unit,"%business intelligence%"),"data directorate",
               like(ssphp_unit,"%it for the it department%"),"IT for the IT department",
               like(ssphp_unit,"%capital group%"),"capital group",
               like(ssphp_unit,"%childrens social care%"),"childrens care",
               like(ssphp_unit,"%lrs%"),"LRS",
               like(ssphp_unit,"%submit learner data%"),"LRS",
               ssphp_unit="unknown","NO AZURE DATA AVAILABLE",
               like(ssphp_unit,"%vulnerability test environment%"),"digital and technology",
               1==1,"-")
| eval ssphp_unit=replace(ssphp_unit,'L1',"")
| table L1, ssphp_unit, *

| eval L2=case(like(ssphp_unit,"%ciso%"),"CISO",
               like(ssphp_unit,"%technology services%"),"technology services",
               like(ssphp_unit,"%statistics as a service%"),"statistics as a service",
               like(ssphp_unit,"%schools and school performance%"),"schools and school performance",
               like(ssphp_unit,"%infrastructure and platforms%"),"infrastructure and platforms",
               like(ssphp_unit,"%shared it core services%"),"shared IT core services",
               like(ssphp_unit,"%data operations%"),"data operations",
               like(ssphp_unit,"%commercial operations%"),"commercial operations",
               like(ssphp_unit,"%national careers service%"),"national careers service",
               like(ssphp_unit,"%data collections%"),"data collections",
               like(ssphp_unit,"%teacher services%"),"teacher services",
               like(ssphp_unit,"%get into teaching%"),"teacher services",
               like(ssphp_unit,"%business intelligence%"),"business intelligence",
               like(ssphp_unit,"%childrens commissioners office website%"),"childrens commissioners office website",
               like(ssphp_unit,"%complete conversions transfers and changes%"),"complete conversions transfers and changes",
               like(ssphp_unit,"%childrens social care%"),"childrens social care",
               like(ssphp_unit,"%social workforce%"),"social workforce",
               like(ssphp_unit,"%analyse schools performance%"),"analyse schools performance",

               like(ssphp_unit,"%teacher training and qualifications%"),"teacher training and qualifications",
               like(ssphp_unit,"%apprenticeships%"),"apprenticeships",
               like(ssphp_unit,"%academies and free schools%"),"academies and free schools",
               like(ssphp_unit,"%academies and maintained schools%"),"academies and free schools",
               like(ssphp_unit,"%data science%"),"data science",
               like(ssphp_unit,"%funding and allocations%"),"funding and allocations",
               like(ssphp_unit,"%pupil exams and testing%"),"pupil exams and testing",
               like(ssphp_unit,"%childrens care%"),"childrens care",
               like(ssphp_unit,"%learner data%"),"learner data",
               like(ssphp_unit,"%customer experience digital and data%"),"customer experience digital and data",
               like(ssphp_unit,"%strategic data collection%"),"strategic data collection",
               like(ssphp_unit,"%organisational portal%"),"organisational portal",
               like(ssphp_unit,"%get help buying for schools%"),"get help buying for schools",
               like(ssphp_unit,"%getting help buying for schools%"),"get help buying for schools",
               like(ssphp_unit,"%growing up well%"),"growing up well",

               like(ssphp_unit,"%get information about schools%"),"get information about schools",
               like(ssphp_unit,"%capital crm application insights%"),"capital crm application insights",
               like(ssphp_unit,"%national tutoring programme%"),"national tutoring programme",
               like(ssphp_unit,"%plan technology for your school%"),"plan technology for your school",
               like(ssphp_unit,"%end user computing%"),"end user computing",
               like(ssphp_unit,"%design operations%"),"design operations",

               like(ssphp_unit,"%corporate services%"),"corporate services",
               like(ssphp_unit,"%cloud%"),"cloud",
               like(ssphp_unit,"%vulnerability test environment%"),"vulnerability test environment",
               like(ssphp_unit,"%openinnovation%"),"openinnovation",
               like(ssphp_unit,"%authentication services%"),"authentication services",
               like(ssphp_unit,"%institute data service%"),"institute data service",
               like(ssphp_unit,"%data archiving platform%"),"data archiving platform",
               like(ssphp_unit,"%dfe internal firewall%"),"dfe internal firewall",

               1==1,"NO AZURE DATA AVAILABLE")

| eval ssphp_unit=replace(ssphp_unit,'L2',"")

| eval L1_display_name='L1', L2_display_name='L2'

| lookup ssphp_business_service_index.csv "Service ID" as ssphp_business_service_index OUTPUT "Service Name" as L2_canon
| eval L2_display_name=coalesce('L2_canon', 'L2_display_name')

| rex field=L1_display_name mode=sed "s/^/ / s/ [aA]/ A/g s/ [bB]/ B/g s/ [cC]/ C/g s/ [dD]/ D/g s/ [eE]/ E/g s/ [fF]/ F/g s/ [gG]/ G/g s/ [hH]/ H/g s/ [iI]/ I/g s/ [jJ]/ J/g s/ [kK]/ K/g s/ [lL]/ L/g s/ [mM]/ M/g s/ [nN]/ N/g s/ [oO]/ O/g s/ [pP]/ P/g s/ [qQ]/ Q/g s/ [rR]/ R/g s/ [sS]/ S/g s/ [tT]/ T/g s/ [uU]/ U/g s/ [vV]/ V/g s/ [wW]/ W/g s/ [xX]/ X/g s/ [yY]/ Y/g s/ [zZ]/ Z/g s/^.//"
| rex field=L2_display_name mode=sed "s/^/ / s/ [aA]/ A/g s/ [bB]/ B/g s/ [cC]/ C/g s/ [dD]/ D/g s/ [eE]/ E/g s/ [fF]/ F/g s/ [gG]/ G/g s/ [hH]/ H/g s/ [iI]/ I/g s/ [jJ]/ J/g s/ [kK]/ K/g s/ [lL]/ L/g s/ [mM]/ M/g s/ [nN]/ N/g s/ [oO]/ O/g s/ [pP]/ P/g s/ [qQ]/ Q/g s/ [rR]/ R/g s/ [sS]/ S/g s/ [tT]/ T/g s/ [uU]/ U/g s/ [vV]/ V/g s/ [wW]/ W/g s/ [xX]/ X/g s/ [yY]/ Y/g s/ [zZ]/ Z/g s/^.//"
| eval L1_display_name=replace(L1_display_name," And"," and"),
       L1_display_name=replace(L1_display_name," A "," a "),
       L1_display_name=replace(L1_display_name," The "," the "),
       L1_display_name=replace(L1_display_name," To "," to "),
       L1_display_name=replace(L1_display_name," As "," as "),
       L1_display_name=replace(L1_display_name," For "," for "),
       L1_display_name=replace(L1_display_name,"  "," "),
       L1_display_name=replace(L1_display_name,"'",""),
       L2_display_name=replace(L2_display_name," And"," and"),
       L2_display_name=replace(L2_display_name," A "," a "),
       L2_display_name=replace(L2_display_name," The "," the "),
       L2_display_name=replace(L2_display_name," To "," to "),
       L2_display_name=replace(L2_display_name," As "," as "),
       L2_display_name=replace(L2_display_name," For "," for "),
       L2_display_name=replace(L2_display_name,"'",""),
       L2_display_name=replace(L2_display_name," -"," "),
       L2_display_name=replace(L2_display_name,"  "," "),
       L1_display_name=trim(L1_display_name), L2_display_name=trim(L2_display_name)

| rex field=L2_display_name "(?<L2_display_name>[^(]*)(")
| eval L2_display_name=if(L2_display_name="ContinuingProfessionalDevelopment","Continuing Professional Development",L2_display_name)

```| search ssphp_business_service_index="s184"```
| rename L1* as ssphp_level_1*, L2* as ssphp_level_2*
| eval ssphp_level_1=trim(ssphp_level_1), ssphp_level_1_display_name=trim(ssphp_level_1_display_name), ssphp_level_2=trim(ssphp_level_2), ssphp_level_2_display_name=trim(ssphp_level_2_display_name)
```=======================end macro=================================================```

"""

iseval = 0